[{"type":"ph","content":"HEALTH EQUITY & DISPARITIES\r\nIN A 21st CENTURY PANDEMIC","logo":"header15.png","subcontent":"Call for Extended Abstracts"},{"type":"ch","content":"Call for Extended Abstracts: Differential Impacts of COVID-19 in NYS"},{"type":"p","content":"The COVID-19 pandemic has exacerbated historical racial and ethnic health and social disparities in New York State. This edited book will present interdisciplinary essays and empirical studies focused on the nature and extent of the disparities; environmental, socioeconomic and occupational factors causing NYS’s racial and ethnic minority groups to be disproportionately impacted by COVID-19; and evaluations of interventions designed to mitigate harm and eliminate disparities. Submissions presenting recommendations drawn from current research and designed to inform future policy and practice toward building equity in health outcomes are encouraged."},{"type":"p","content":"Authors of accepted extended abstracts will be invited to participate in a virtual  Symposium during which they will present their work for input and comment by other symposium participants.  Complete chapters are due two months following the Symposium, at which point they will be peer reviewed through a peer review process. Due to the timely nature of the content, all accepted abstracts and draft and final chapters will be made available through an open access repository.  A preferred topics list is provided below. Please also consider emailing an editor if you want to check on the fit of your topic to the scope of the book."},{"type":"p","content":""},{"type":"p","content":"<b>Timeline:</b>","style":"font-color:#46166b"},{"type":"ul","content":"dot-list"},{"type":"li","content":"Apr 26, 2021 - Due date for extended abstract"},{"type":"li","content":"May 12, 2021 - Author notifications on extended abstracts"},{"type":"li","content":"Jun 01, 2021 - Accepted extended abstract submissions posted to the open access repository"},{"type":"li","content":"May 12, 2021 - Registration period for Symposium"},{"type":"li","content":"Jun 21, 2021 - Day 1 of Virtual Symposium, 9:00am-12noon EST"},{"type":"li","content":"Jun 28, 2021 - Day 2 of Virtual Symposium, 9:00am-12noon EST"},{"type":"li","content":"Sep 15, 2021 - Due date for full chapter"},{"type":"li","content":"Sep 20, 2021 - Chapter submissions posted to the open access repository"},{"type":"li","content":"Sep 20, 2021 - Chapter peer review process begins"},{"type":"li","content":"Dec 01, 2021 - Decisions to chapter authors"},{"type":"li","content":"Jan 15, 2022 - Due date for final chapters with revisions"},{"type":"li","content":"Feb 01, 2022 - Final chapters posted to repository"},{"type":"li","content":"Feb 15, 2022 - Full collection available on open access repository"},{"type":"/ul","content":""}]